{"galleryThumbs": [
    {"key": 0, "title":"The Beginning", "image":"./assets/thumbNutZ.jpg", "tool":"TI99/4A"},
    {"key": 1, "title":"Nissan Sentra Big Shot", "image":"./assets/thumbBigShot.jpg", "tool":"Unity with Logitech G920 Steering Wheel"},
    {"key": 2, "title":"Nissan Pride & Progess Art Wall", "image":"./assets/thumbArtWall.jpg", "tool":"Unity with HTC Vive"},
    {"key": 3, "title":"Xfinity Bobble Head Creator", "image":"./assets/thumbXfinityBobble.jpg", "tool":"Unity and DLib"},
    {"key": 4, "title":"Assoc. Bank Grand Slam Challenge", "image":"./assets/thumbGSC.jpg", "tool":"Unity with Arduino"},
    {"key": 5, "title":"Katy Perry Witness Tour AR Photo Booth", "image":"./assets/thumbKatyPerry.jpg", "tool":"Adobe Animate with Facial recognition"},
    {"key": 6, "title":"Associated Bank Suit Up", "image":"./assets/thumbSuitUp.jpg", "tool":"Unity with Bellus 3D Camera"},
    {"key": 12, "title":"Esurance Buster Posey VR Experience", "image":"./assets/thumbPosey.jpg", "tool":"Unity with HTC Vive"},
    {"key": 13, "title":"Warner Bros. Wand Master Training", "image":"./assets/thumbBeasts.jpg", "tool":"Unity with OpenCV"},
    {"key": 7, "title":"GMR The Lab VR interface", "image":"./assets/thumbTheLab.jpg", "tool":"Unity with HTC Vive"},
    {"key": 8, "title":"Fixel 3D Display Prototype", "image":"./assets/thumbFixel.jpg", "tool":"Unity and Arduino"},
    {"key": 9, "title":"XYZBert - WebGL Game", "image":"./assets/thumbXYZBert.jpg", "tool":"Unity and Blender"},
    {"key": 10, "title":"Some Shaders", "image":"./assets/thumbShaders.jpg", "tool":"Unity - Shader Graph"},
    {"key": 11, "title":"Blender Learnings", "image":"./assets/thumbBlender.jpg", "tool":"Blender 2.8"}
],
"galleryData":[{"key":0, "div":3, "text":"I started making games, back in the late 80's, on the TI99/4A home computer from Texas Instruments. I used TI Extended Basic and even made a little money - getting several games published in MICROpendium magazine.", "images":[{"src":"./assets/croaker1.png"},{"src":"./assets/croaker2.png"},{"src":"./assets/rockhopper1.png"},{"src":"./assets/rockHopper2.png"},{"src":"./assets/nutz1.png"},{"src":"./assets/nutz2.png"}]},
{"key":1, "text":"An arcade style pop-a-shot game controlled with a Logitech G920 steering wheel and gas pedal. This game was to be used in an activation at the 2020 Final Four in Atlanta, until covid got it canceled. This game features several custom shader graph shaders. I created the 3D assets in 3DS Max. UI elements and also look dev were provided by Millie Bley.", "images":[{"src":"./assets/nissan_bigShot_1.png"},{"src":"./assets/nissan_bigShot_2.png"},{"src":"./assets/nissan_bigShot_3.png"},{"src":"./assets/nissan_bigShot_4.png"},{"src":"./assets/nissan_bigShot_5.png"},{"src":"./assets/nissan_bigShot_6.png"},{"src":"./assets/nissan_bigShot_7.png"},{"src":"./assets/nissan_bigShot_8.png"},{"src":"./assets/nissan_bigShot_9.png"},{"src":"./assets/nissan_bigShot_10.png"},{"src":"./assets/nissan_bigShot_11.png"}]},
{"key":2, "text":"The Pride and Progress art wall toured the country and allowed people to paint, graffiti style, on an 80 inch monitor. The 'paint can' was a HTC Vive controller only - no headset required, which was the tricky part. During the setup phase, a brand ambassador would use the Vive controller to mark out the physical corners of the monitor - the Unity camera was then set to view that rectangle full screen.", "images":[{"src":"./assets/nissan_prideProgress1.png"},{"src":"./assets/nissan_prideProgress2.png"},{"src":"./assets/nissan_prideProgress3.png"}]},
{"key":4, "text":"The Grand Slam Challenge game lived on the first floor of Miller Park for two full seasons and was played by thousands of fans. A custom bat held an Arduino Nano, IMU, blue tooth module, and battery and allowed the in-game bat to respond to the players motions in a fairly realistic manner.", "images":[{"src":"./assets/gsc1.jpg"}]},
{"key":5, "text":"The Katy Perry Witness tour photo booth used facial recognition to overlay KP like couture makeup effects on up to four people at once. I created this in Adobe Animate and used the Beyond Reality plugin for facial and landmark dectection.", "images":[{"src":"./assets/katyPerry1.png"},{"src":"./assets/katyPerry1.jpg"},{"src":"./assets/katyPerry2.jpg"}]},
{"key":6, "text":"Suit Up is part of the Associated Bank Path to the Pack experiential branch in the Title Town district at Lambeau Field. Fans have their face and head scanned in 3D and are then placed into a Packers uniform of their choosing. After that they pick a position, and a video is created where they are the star.", "images":[{"src":"./assets/titletown-3.jpg"},{"src":"./assets/titletown-4.jpg"}, {"src":"./assets/suitup1.png"},{"src":"./assets/suitup2.png"},{"src":"./assets/suitup3.png"}]},
{"key":7, "text":"The GMR Lab was a place to showcase various digital projects to clients, sales people, etc. Since there were numerous VR pieces I developed a menu system to allow easy picking of the various apps. For a fun twist I modeled the actual lab space in 3D and used that in the menu. You could put on the Vive headset and walk around the space without fear of running into anything because the physical and virtual spaces matched nearly identical.", "images":[{"src":"./assets/thelab_menu1.png"}, {"src":"./assets/thelab_menu2.png"}, {"src":"./assets/thelab_menu3.png"}, {"src":"./assets/thelab_menu4.png"}]},
{"key":8, "text":"Another victim of covid, The Fixel is a depth based physical display controlled with Arduinos and stepper motors. Lots of them. Each pixel in the display is controlled by a stepper motor, with four steppers per individual 'module'. Communication was done with I2C between Arduinos, and Unity is used to process the camera or image data and send it to the master arduino.", "images":[{"src":"./assets/fixel1.png"}, {"src":"./assets/fixel2.png"}, {"src":"./assets/fixel3.png"}, {"src":"./assets/module.png"}]},
{"key":9, "div":3, "text":"Just my 3D take on the original QBert. Originally I made this game in Director about 15 years ago and thought it would be fun to do again in Unity for WebGL.", "images":[{"src":"./assets/xyz3.png"}, {"src":"./assets/xyz2.png"}, {"src":"./assets/xyz1.png"}, {"src":"./assets/buttonPlay.png", "link":"https://xyzbert.netlify.app/", "dl":"false"}]},
{"key":3, "text":"The bobble head creator was to be used at various events in 2020 but hasn't yet seen the light of day due to covid. It was a fun piece to make though and uses a custom chroma key shader as well as DLib for facial landmark detection. Just a green screen isn't enough to automatically cut out the users head so I used DLib to get the points around the chin and created a virtual green screen in front of the person - leaving only their head remaining.", "images":[{"src":"./assets/xfinity_bobble1.png"},{"src":"./assets/xfinity_bobble2.png"},{"src":"./assets/xfinity_bobble3.png"},{"src":"./assets/xfinity_bobble4.png"},{"src":"./assets/xfinity_bobble5.png"}]},
{"key":10, "text":"Now that Unity has Shader Graph I've been able to make some custom shaders when the need has presented itself. I'm still no shader wizard by any means but I'm learning and it's fun stuff. Here's a couple shaders I've made for projects that I thought might be helpful. I'll add more as I can.", "images":[{"src":"./assets/shaderChroma.png", "text":"Click to download Chroma Keyer unity package", "link":"./assets/ChromaKeyer.unitypackage", "dl":"true"}, {"src":"./assets/shaderOutline.png", "text":"Click to download 2D Sprite outliner unity package", "link":"./assets/OutlineSprite.unitypackage", "dl":"true"}]},
{"key":12, "div":3, "text":"The Esurance Buster Posey VR Experience allowed fans to get behind the plate and experience what it's like to catch a pitch from a major league pitcher. Created for the HTC Vive the catcher's glove was outfitted with a Vive tracker for precise hand/glove tracking. Also in the glove was a custom haptic feedback unit that helped to simulate the feeling of catching a pitch.", "images":[{"src":"./assets/esurance1.jpg"}, {"src":"./assets/esurance2.jpg"}, {"src":"./assets/esurance3.jpg"}, {"src":"./assets/esurance4.jpg"}, {"src":"./assets/esurance5.jpg"}]},
{"key":13, "text":"Wandmaster Training was created for the first Fantastic Beasts movie, but was also used to help promote the second movie as well. Users were given a wand and on-screen instructions showed them how to move the wand to cast a specific spell. Wands were outfitted with an IR LED in the tip, and OpenCV's blob detector was used to segment the IR spot from the rest of the video. Particle effects were then added to make it look like a spell was being cast when the wand was moved around. Two web cams were used to do this - one for regular video recording, and one that was modifed to only see IR. For this I modified about 100 Logitech C610 cameras - carefully taking out the lens and placing a 1/4 inch square of floppy disk material over the cmos sensor before replacing the lens.", "images":[{"src":"./assets/beasts1.jpg"}, {"src":"./assets/beasts2.jpg"}]},
{"key":11, "div":3, "text":"I've been a 3DS Max guy since before Max existed. I started using Max back when it was called 3D Studio, before it got the nice modern UI it has now. These days however, I've been using Blender ever since the 2.8 edition dropped. For one, it's free. And second, it's a really great tool. Here's a few samples I've created while trying to learn it. If you're looking to learn I recommend Imphenzia's channel on YouTube and also any video from Ian Hubert.", "images":[ {"src":"./assets/duck.png"}, {"src":"./assets/lowPolyCar.png"},{"src":"./assets/build.png"}, {"src":"./assets/llama.png"}, {"src":"./assets/leopard.png"}, {"src":"./assets/giraffe.png"}, {"src":"./assets/kadesBed.jpg"},  {"src":"./assets/qb.png"}]}]}